---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctPressureDropData.Velocity
source: html/ed2a2ffa-bf61-7312-1d7b-def50b5ecbed.htm
---
# Autodesk.Revit.DB.Mechanical.DuctPressureDropData.Velocity Property

The velocity of the duct. Units: (ft/s).

## Syntax (C#)
```csharp
public double Velocity { get; set; }
```